{
  "backend/main.mo": "Motoko backend managing user profiles, child profiles, alarm events, biometric records, and PIN verification with access control enforcement.",
  "feature_evidence.json": "Metadata listing implemented features, affected files, components, and test IDs for deployment, branding, and routing updates.",
  "frontend-file-summaries.txt": "Pre-written summaries describing the purpose of each frontend component, hook, and page.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining steps to build and publish the app to the Internet Computer.",
  "frontend/index.css": "Tailwind-based global styling defining light and dark themes using OKLCH color variables.",
  "frontend/index.html": "HTML entry file setting app metadata and loading the main client script.",
  "frontend/public/404.html": "Static 404 page that redirects deep links back to the SPA root with encoded route information.",
  "frontend/src/App.tsx": "Main React app configuring routing, SPA deep‑link recovery, theme provider, and user profile setup logic.",
  "frontend/src/components/Alarm/PinAcknowledgeForm.tsx": "Form for entering and verifying the guardian PIN to acknowledge and stop an active alarm.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and query‑cache clearing.",
  "frontend/src/components/Auth/ProfileSetupModal.tsx": "Modal for first‑time guardian profile creation, saving the user's name to the backend.",
  "frontend/src/components/Guardian/AlarmEventLog.tsx": "Displays a scrollable list of alarm/access events, showing child name, timestamp, and acknowledgment status using fetched event and profile data.",
  "frontend/src/components/Guardian/BiometricRecordsManager.tsx": "Manages adding, viewing, and deleting biometric and touch records for a selected child, combining both record types into a unified timeline.",
  "frontend/src/components/Guardian/ChildProfilesManager.tsx": "Handles creating, renaming, archiving, and listing child profiles with dialogs and loading states.",
  "frontend/src/components/Guardian/GuardianPinSettings.tsx": "Provides a form to set or update the guardian PIN with basic validation and server-side persistence.",
  "frontend/src/components/Guardian/PrincipalLinkingPanel.tsx": "Allows linking or unlinking Internet Identity principals to child profiles and shows guidance about principal-based authentication.",
  "frontend/src/components/Guardian/TouchCapturePad.tsx": "Captures raw touch samples during pointer interaction, normalizing coordinates and emitting collected data to a parent component.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout component with header, navigation, alarm redirect logic, and footer.",
  "frontend/src/hooks/queries/useAlarm.ts": "React Query hooks for checking alarm status and triggering or acknowledging alarms.",
  "frontend/src/hooks/queries/useAlarmEvents.ts": "Fetches alarm event history from the backend actor.",
  "frontend/src/hooks/queries/useBiometricRecords.ts": "Hooks for retrieving, adding, and deleting biometric records tied to a child.",
  "frontend/src/hooks/queries/useChildProfiles.ts": "CRUD hooks for child profiles using the backend actor.",
  "frontend/src/hooks/queries/useCurrentUser.ts": "Hooks for fetching and updating the caller's user profile, role, and admin status.",
  "frontend/src/hooks/queries/useGuardianPin.ts": "Mutation hooks for setting and verifying the guardian PIN.",
  "frontend/src/hooks/queries/usePrincipalLinks.ts": "Hooks for linking and unlinking principals to child profiles and fetching linked data.",
  "frontend/src/hooks/queries/useTouchRecords.ts": "Hooks for managing touch records for a child, including add and delete operations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login handling, and identity persistence.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity provider and rendering the app.",
  "frontend/src/pages/Alarm.tsx": "Displays an alarm screen when a child profile triggers access, plays a looping synthesized audio tone, and requires guardian PIN acknowledgement to stop the alarm.",
  "frontend/src/pages/Dashboard.tsx": "Renders the guardian dashboard with tabs for managing child profiles, records, linked accounts, logs, and PIN settings, restricting access to admin users.",
  "frontend/src/pages/Landing.tsx": "Landing page handling authentication state, promoting app features, and allowing guardians or linked children to trigger or simulate alarms.",
  "frontend/src/pages/LimitationsPrivacy.tsx": "Shows information about app limitations and privacy practices, including browser constraints and how stored biometric or touch-sensing data is handled.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash fragments, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom themes, colors, animations, plugins, and responsive container settings for the app UI.",
  "project_state.json": "Tracks the project’s state, requirements, and architectural notes for a child-access detection app, including constraints around biometrics, data storage, and domain rules. Lists existing features, known issues, and versioning details for planning future development."
}