{
  "backend/main.mo": "Main backend canister implementing authorization, child profiles, alarm events, biometric record storage, and guardian PIN logic with persistent state.",
  "backend/migration.mo": "Migration module upgrading old actor state to include biometric record fields and counters.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files, describing their purpose and functionality.",
  "frontend/index.css": "Global Tailwind CSS theme variables and base styles for light and dark modes.",
  "frontend/index.html": "Base HTML file bootstrapping the React application with root container and script entry.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router, theme provider, and conditional profile setup modal.",
  "frontend/src/components/Alarm/PinAcknowledgeForm.tsx": "Form to verify guardian PIN and acknowledge an active alarm with validation and status feedback.",
  "frontend/src/components/Auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth flow and query cache clearing.",
  "frontend/src/components/Auth/ProfileSetupModal.tsx": "Modal for first‑time guardian profile setup collecting a name and saving it to the backend.",
  "frontend/src/components/Guardian/AlarmEventLog.tsx": "Displays alarm and access event history, fetching events and child profiles and rendering them with status indicators.",
  "frontend/src/components/Guardian/BiometricRecordsManager.tsx": "Manages biometric and touch-sensing records per child, allowing adding, viewing, and deleting records with dialogs and validation.",
  "frontend/src/components/Guardian/ChildProfilesManager.tsx": "Provides UI to create, rename, and archive child profiles, including dialogs and loading states.",
  "frontend/src/components/Guardian/GuardianPinSettings.tsx": "Allows guardians to set or update a PIN, validating input and submitting it via a mutation.",
  "frontend/src/components/Guardian/PrincipalLinkingPanel.tsx": "Links or unlinks Internet Identity principals to child profiles, handling validation and displaying warnings.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout with navigation, footer, authentication checks, and auto-redirect when an alarm is active.",
  "frontend/src/hooks/queries/useAlarm.ts": "Provides hooks to check alarm status and trigger or acknowledge alarms, with automatic query cache updates.",
  "frontend/src/hooks/queries/useAlarmEvents.ts": "Fetches alarm event history from the backend using react-query and the actor API.",
  "frontend/src/hooks/queries/useBiometricRecords.ts": "Provides React Query hooks to fetch, add, and delete biometric records for a child, invalidating queries on mutations.",
  "frontend/src/hooks/queries/useChildProfiles.ts": "Defines hooks to retrieve, create, rename, and archive child profiles using the actor API with query invalidation.",
  "frontend/src/hooks/queries/useCurrentUser.ts": "Supplies hooks for reading and updating the caller’s user profile and role, including admin checks.",
  "frontend/src/hooks/queries/useGuardianPin.ts": "Offers mutation hooks for setting and verifying a guardian PIN via the actor API.",
  "frontend/src/hooks/queries/usePrincipalLinks.ts": "Contains hooks for linking and unlinking principals to child profiles and fetching the linked profile.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication state and identity loading.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Alarm.tsx": "Displays an alarm screen with audio signaling and a PIN acknowledgment form when a child access alarm is active.",
  "frontend/src/pages/Dashboard.tsx": "Renders the guardian dashboard with tabs for profiles, records, linking, logs, and settings, gated by user role.",
  "frontend/src/pages/Landing.tsx": "Landing page that handles authentication state, displays feature highlights, and allows guardians or linked children to trigger an alarm.",
  "frontend/src/pages/LimitationsPrivacy.tsx": "Static page explaining web app limitations and privacy details related to manual triggers and guardian‑managed data.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project metadata describing app goals, requirements, architectural notes, known issues, and implemented features."
}