{
  "backend/main.mo": "Motoko backend implementing authorization, user profiles, guardian PIN, child profiles, and alarm event/state management with AccessControl enforcement.",
  "feature_evidence.json": "Feature evidence report mapping high-level requirements to frontend files, components, and confidence metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten one‑sentence summaries for all frontend source files.",
  "frontend/index.css": "Tailwind CSS base/theme configuration defining OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, theme provider, and root layout with automatic profile setup modal for new users.",
  "frontend/src/components/Alarm/PinAcknowledgeForm.tsx": "Form for verifying the guardian PIN and acknowledging an active alarm via backend mutations.",
  "frontend/src/components/Auth/LoginButton.tsx": "Internet Identity login/logout button with loading states and query cache clearing on logout.",
  "frontend/src/components/Auth/ProfileSetupModal.tsx": "Modal for initial guardian profile creation, submitting name and role to the backend.",
  "frontend/src/components/Guardian/AlarmEventLog.tsx": "Displays a scrollable list of alarm and access events, showing child names, timestamps, and acknowledgment status.",
  "frontend/src/components/Guardian/ChildProfilesManager.tsx": "Provides UI to create, rename, archive, and list child profiles using related backend mutations.",
  "frontend/src/components/Guardian/GuardianPinSettings.tsx": "Allows guardians to set or change their PIN with validation and server-side mutation.",
  "frontend/src/components/Guardian/PrincipalLinkingPanel.tsx": "Enables linking and unlinking Internet Identity principals to child profiles with validation and backend calls.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout, navigation, header, footer, and auto-redirects if an alarm is active.",
  "frontend/src/hooks/queries/useAlarm.ts": "Provides hooks to query alarm status and trigger or acknowledge alarms while updating related queries.",
  "frontend/src/hooks/queries/useAlarmEvents.ts": "Fetches alarm event history from the backend using react-query.",
  "frontend/src/hooks/queries/useChildProfiles.ts": "Contains hooks to fetch, create, rename, and archive child profiles with query invalidation.",
  "frontend/src/hooks/queries/useCurrentUser.ts": "Exposes hooks for fetching and saving the current user profile and checking user roles.",
  "frontend/src/hooks/queries/useGuardianPin.ts": "No summary available.",
  "frontend/src/hooks/queries/usePrincipalLinks.ts": "No summary available.",
  "frontend/src/hooks/useActor.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/index.css": "No summary available.",
  "frontend/src/main.tsx": "No summary available.",
  "frontend/src/pages/Alarm.tsx": "No summary available.",
  "frontend/src/pages/Dashboard.tsx": "No summary available.",
  "frontend/src/pages/Landing.tsx": "No summary available.",
  "frontend/src/pages/LimitationsPrivacy.tsx": "React page showing cards that explain web app limitations and privacy assurances, especially that no biometrics are collected and Internet Identity is used.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and sessionStorage-backed values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, layout, keyframes, and plugin usage for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing app goals, architectural notes, known issues, required images, and a list of existing implemented features."
}