{
  "kind": "build_request",
  "title": "Publish the app (deployment readiness + valid domain slug)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Add a production publishing checklist and deployment steps document that explains how to deploy the backend canister and the frontend assets to the Internet Computer, including how to configure a custom domain and the exact domain slug constraints (5–50 chars; letters, numbers, hyphens only).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Publish the app"
        ]
      },
      "acceptanceCriteria": [
        "A new documentation file exists in the repo (e.g., DEPLOYMENT.md or README section) describing: build, deploy, upgrade, and how to attach a custom domain.",
        "The document explicitly states the domain slug validation rules: 5–50 characters and only letters, numbers, and hyphens.",
        "The document includes an example of converting the desired name \"child access control\" into a valid slug (e.g., \"child-access-control\")."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Update user-facing app metadata to reflect the new app name \"Child Access Control\" consistently where it appears in the UI and page metadata, without using invalid domain characters.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Rename this to child access control",
          "Publish the app"
        ]
      },
      "acceptanceCriteria": [
        "The browser tab title (frontend/index.html) uses an English title consistent with \"Child Access Control\".",
        "The header branding in the app shell remains consistent and does not reference invalid domain strings or previously failed domain attempts."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Ensure the frontend routing and asset paths work correctly when the app is served from a custom domain over HTTPS, including direct navigation to routes like /dashboard, /alarm, and /limitations and loading generated assets from /assets/generated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Publish the app"
        ]
      },
      "acceptanceCriteria": [
        "A production build loads successfully and can navigate directly to /, /dashboard, /alarm, and /limitations without a blank page.",
        "The generated icon referenced by the app shell (e.g., /assets/generated/alarm-bell-icon.dim_512x512.png) loads correctly in production.",
        "No changes are made to any frontend immutablePaths files (hooks and ui components listed as immutable)."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: all Motoko logic remains in backend/main.mo; add backend/migration.mo only if a state upgrade is required.",
    "Do not modify any files under frontend immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui). Compose existing UI components instead.",
    "Domain slug must be 5–50 characters and contain only letters, numbers, and hyphens."
  ],
  "nonGoals": [
    "Implementing new product features unrelated to publishing (e.g., new alarm logic, new biometric/touch schemas, new dashboard features).",
    "Adding third-party hosting, external databases, or non-Internet-Computer deployment targets.",
    "Adding third-party authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}