{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Guardian-managed biometric/touch-sensing record UI + updated privacy/limitations copy",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Add a guardian-only Dashboard section to add, list, and delete biometric/touch-sensing records per child profile using React Query.",
      "acceptanceCriteria": [
        "A new guardian-facing section is available from the existing dashboard (e.g., under the Profiles tab or a new tab) to manage biometric/touch-sensing records per child profile.",
        "Guardian can select a child profile and add a new record (with clear labeling of the data type: “biometric” vs “touch-sensing”).",
        "Guardian can view a list of records for the selected child profile, including at minimum: record type and created timestamp.",
        "Guardian can delete individual records and can delete all records for a child profile, with a confirmation step before destructive actions.",
        "All data operations are wired via React Query mutations/queries and the UI shows loading and error states (toast or inline)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queries/useBiometricRecords.ts",
          "operation": "create",
          "description": "Create React Query hooks for biometric/touch-sensing record management: query to list records for a selected child profile, mutation to add a record, and mutation to delete a record; include cache invalidation for the selected child’s record list. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Guardian/BiometricRecordsManager.tsx",
          "operation": "create",
          "description": "Implement a guardian-only UI panel to manage biometric/touch-sensing records per child profile: child selector (using existing child profiles query), add-record form with dataType choice (“biometric” vs “touch-sensing”) and explicit user-entered data input, records list showing dataType + created timestamp, and destructive actions (delete single, delete all via confirmed action; delete-all can be implemented by sequentially deleting listed records if no single-call backend capability is available). Use shadcn-ui components (e.g., Card, Button, Input, Select/Radio, Dialog) for consistent styling and use toast/inline error states. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Wire the new BiometricRecordsManager into the existing Guardian Dashboard Tabs as an additional tab/section (keeping existing tabs). Ensure the section remains guardian-only by relying on the current role gate that uses the authorization system’s role checks (via useGetCallerUserRole) and shows Access Denied to non-guardians. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Update Landing and Limitations & Privacy copy to accurately describe stored biometric/touch-sensing records, guardian responsibility, and web-app touch-detection limitations.",
      "acceptanceCriteria": [
        "The Limitations & Privacy page (frontend/src/pages/LimitationsPrivacy.tsx) no longer states “This app does NOT collect, store, or process any biometric data.”",
        "The Limitations & Privacy page clearly states (in English) that this is a web app and still cannot perform automatic device-level touch detection outside the browser context.",
        "The Landing page marketing bullet “Uses device authentication without collecting biometric data” is updated to reflect the new behavior accurately (in English).",
        "All updated text is consistent across pages and does not claim capabilities the app does not implement (e.g., no claim of OS-wide touch monitoring)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LimitationsPrivacy.tsx",
          "operation": "modify",
          "description": "Revise the Privacy & Biometric Data section copy to remove the absolute claim that no biometric data is collected/stored; replace with accurate statements: (1) the app may store guardian-entered/guardian-managed records labeled as “biometric” or “touch-sensing” tied to child profiles, (2) the app does not capture device biometrics (no fingerprint/FaceID/TouchID data is exposed to the web app), (3) the web app cannot perform OS-level/system-wide touch detection and only stores data explicitly provided within the app UX, and (4) include clear guardian responsibility language and avoid implying any regulatory compliance guarantees. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Landing.tsx",
          "operation": "modify",
          "description": "Update the marketing bullet text that currently says “Uses device authentication without collecting biometric data” to an accurate English statement aligned with the new behavior (guardian-managed record storage; no device biometrics are captured). Ensure the revised wording does not claim OS-level touch monitoring or automatic device-level touch detection. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}