{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Publish readiness: metadata, deep-link routing, and deployment documentation",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Add a production publishing checklist and deployment steps doc (including custom domain + domain slug constraints).",
      "acceptanceCriteria": [
        "A new documentation file exists in the repo (e.g., DEPLOYMENT.md or README section) describing: build, deploy, upgrade, and how to attach a custom domain.",
        "The document explicitly states the domain slug validation rules: 5–50 characters and only letters, numbers, and hyphens.",
        "The document includes an example of converting the desired name \"child access control\" into a valid slug (e.g., \"child-access-control\")."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "create",
          "description": "Create a deployment/readiness document tailored to Internet Computer publishing: production build steps, frontend assets deployment considerations (including SPA deep-link handling), upgrade checklist, custom domain attachment steps, and explicit domain slug validation rules (5–50 chars; letters, numbers, hyphens only) including the example \"child access control\" → \"child-access-control\"."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Update user-facing app metadata and visible branding to consistently use the name \"Child Access Control\".",
      "acceptanceCriteria": [
        "The browser tab title (frontend/index.html) uses an English title consistent with \"Child Access Control\".",
        "The header branding in the app shell remains consistent and does not reference invalid domain strings or previously failed domain attempts."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the document title and any relevant page metadata to use the app name \"Child Access Control\" consistently (ensure no invalid domain characters are introduced into user-facing text)."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Update header branding text (and relevant alt text) to consistently display \"Child Access Control\" (avoid any prior/invalid domain-string branding)."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Ensure deep-link routing and generated asset paths work correctly when served from a custom HTTPS domain (including direct navigation to /dashboard, /alarm, /limitations and loading /assets/generated).",
      "acceptanceCriteria": [
        "A production build loads successfully and can navigate directly to /, /dashboard, /alarm, and /limitations without a blank page.",
        "The generated icon referenced by the app shell (e.g., /assets/generated/alarm-bell-icon.dim_512x512.png) loads correctly in production.",
        "No changes are made to any frontend immutablePaths files (hooks and ui components listed as immutable)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add SPA deep-link recovery logic for static hosting: when the app is loaded at / with a redirect indicator (set by a static 404 fallback page), automatically navigate to the intended route and clean up the URL so direct navigation to /dashboard, /alarm, and /limitations works without a blank page (do not modify immutable hooks or ui components)."
        },
        {
          "path": "frontend/public/404.html",
          "operation": "create",
          "description": "Add a static fallback page that captures unknown paths (e.g., /dashboard) and redirects to / with an encoded redirect parameter so the SPA can recover and render the correct route under HTTPS custom domains."
        },
        {
          "path": "frontend/public/assets/generated/alarm-bell-icon.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated icon asset at this exact path so absolute asset references to /assets/generated/alarm-bell-icon.dim_512x512.png resolve correctly in production."
        },
        {
          "path": "frontend/public/assets/generated/phone-alert-illustration.dim_1200x600.png",
          "operation": "create",
          "description": "Add the generated illustration asset at this exact path so /assets/generated/phone-alert-illustration.dim_1200x600.png resolves correctly in production."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Confirm the app shell continues referencing generated assets via /assets/generated/* and that the icon path remains correct for production custom-domain hosting (no changes to immutablePaths)."
        },
        {
          "path": "frontend/src/pages/Landing.tsx",
          "operation": "modify",
          "description": "Confirm/adjust generated illustration usage to ensure it loads from /assets/generated in production and remains consistent with the updated app naming (no changes to immutablePaths)."
        }
      ]
    }
  ]
}